EDT/ZUP/zup_edt/src/InformationRegisters/ОтправкаРезюме/ОтправкаРезюме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправкаРезюме</name>
  <resources>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/ОтправкаРезюме/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеРезультатаОтправки() Экспорт
	
	Результат = Новый Структура(
		"Отправлено,
		|ОписаниеОшибки,
		|ДатаОтправления");
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьРезультатОтправки(Кандидат, Получатель, РезультатОтправки) Экспорт

	МенеджерЗаписи = РегистрыСведений.ОтправкаРезюме.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кандидат = Кандидат;
	МенеджерЗаписи.Получатель = Получатель;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РезультатОтправки);
	МенеджерЗаписи.Комментарий = РезультатОтправки.ОписаниеОшибки;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
